In [ ]:
#Series (array)
#Dataframes (Filas y columnas)
#Paneles (+ 2 dimensiones)

In [ ]:
import pandas as pd

In [4]:
#Generar dataframe a partir de una lista
data=[['Juan', 25], ['Pedro',34], ['Luis', 45]]
#asignar nombre y crear el dataframe
df = pd.DataFrame(data, columns=['Nombre', 'Edad'])
#df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Pedro    34
2   Luis    45

In [5]:
#Crear dataframe desde un diccionario
data = {
    'Nombre': ['Ana', 'Maria', 'Luisa'], 
    'Edad': [23, 45, 34]
}
df = pd.DataFrame(data)
df

  Nombre  Edad
0    Ana    23
1  Maria    45
2  Luisa    34

In [6]:
# Leer desde un archivo csv local
df = pd.read_csv('./utils/data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [9]:
#Leer archivo sin cabecera
df = pd.read_csv('./utils/data/data_without_header', header=None, names=['Nombre', 'Edad', 'Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
#Leer un archivo si extension, con un separador
df = pd.read_csv('./utils/data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [11]:
df = pd.read_json('./utils/data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

Metodos Dataframe

In [12]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [13]:
#Listar elementos
df.head(2) #Primeros 2 elementos

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [14]:
df.tail(2) #Ultimos 2 elementos

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [15]:
#Extraer columnas
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
df.count()

nombre    3
edad      3
ciudad    3
dtype: int64

Acceder Valores con Dataframe

In [19]:
#Selecciona una columna
df['ciudad']
#df.ciudad

0       Madrid
1    Barcelona
2      Sevilla
Name: ciudad, dtype: object

In [20]:
df[['ciudad', 'edad']]

      ciudad  edad
0     Madrid    25
1  Barcelona    30
2    Sevilla    35

In [24]:
#Seleccionar una fila por su indice
print(df.loc[2])
print("#### \n")
print(df.iloc[0])
print("#### \n")
print(df[df['edad'] > 30])

nombre      Pedro
edad           35
ciudad    Sevilla
Name: 2, dtype: object
####

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object
####

  nombre  edad   ciudad
2  Pedro    35  Sevilla

Agrupaciones

In [27]:
data = {
    'Grupo': ['A', 'B', 'A','B', 'A','B'],
    'Valor': [10, 20, 30, 40, 50, 60]   
}
#creamos el DataFrame
df = pd.DataFrame(data)
#Promedio de valor por grupo
promedio_por_grupo= df.groupby('Grupo').mean()
print(promedio_por_grupo)

#Suma por valores
suma_por_grupo = df.groupby('Grupo').sum()
print(suma_por_grupo)

       Valor
Grupo
A       30.0
B       40.0
       Valor
Grupo
A         90
B        120

In [33]:
#Lee la data sin extension
df = pd.read_csv('./utils/data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [35]:
#NaN => valor no numerico
# None  => Ausencia de valor
# Null => No existe en python
#Elimina las filas que contienen valores desconocidos (NaN)
df_sin = df.dropna()
df_sin

print("#### \n")
#reemplazar valores desconocidos por default
df_completo = df.fillna(value=0)
df_completo

df_sin_na = df.dropna(subset=['edad'])
df_sin_na   

print("#### \n")

df_completo_final = df['edad'].fillna(value=0)
df_completo_final

####

####

0     0.0
1    30.0
2    35.0
Name: edad, dtype: float64

Funciones en un dataframe

In [ ]:
#dataframe
data = {
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8]
}

df = pd.DataFrame(data)

In [ ]:
#df['A_doblre']= df['A'].apply(lambda x: x * 2)

KeyError: 'A'